# TopExtension Property (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
AnalyticalModelSurface..::..TopExtension Property
AnalyticalModelSurface Class See Also
---
The top extension option.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2015
# Syntax
C#
---
```text
public SurfaceElementExtension TopExtension { get; set; }
```

Visual Basic
---
```text
Public Property TopExtension As SurfaceElementExtension
	Get
	Set
```

Visual C++
---
```text
public:
property SurfaceElementExtension TopExtension {
	SurfaceElementExtension get ();
	void set (SurfaceElementExtension value);
}
```

# Remarks
Analytical model elements for walls support extension options, while those for floor or slabs do not. If used on analytical model that do not support extension, exception InvalidOperationException will be thrown. To chcek if analytical model support extension use HasExtension property.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
AnalyticalModelSurface Class
Autodesk.Revit.DB.Structure Namespace